{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [30], "batch_input_shape": [null, 30, 1], "trainable": true, "name": "reshape_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 16, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 16, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 16, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 16, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 16, "kernel_regularizer": null, "name": "dense_5", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 4, "kernel_regularizer": null, "name": "dense_6", "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null}}]}