{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "batch_input_shape": [null, 30, 1], "dtype": "float32", "target_shape": [30], "name": "reshape_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 16, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 16, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 16, "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 16, "activity_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 16, "activity_regularizer": null, "name": "dense_5", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 4, "activity_regularizer": null, "name": "dense_6", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear"}}]}