{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 30, 1], "target_shape": [30], "dtype": "float32", "name": "reshape_1"}, "class_name": "Reshape"}, {"config": {"activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_5", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 16, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_6", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}