{"backend": "tensorflow", "keras_version": "2.1.6", "config": [{"config": {"name": "reshape_1", "dtype": "float32", "trainable": true, "batch_input_shape": [null, 30, 1], "target_shape": [30, 1]}, "class_name": "Reshape"}, {"config": {"name": "gru_1", "go_backwards": false, "implementation": 1, "bias_constraint": null, "return_state": false, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "trainable": true, "reset_after": false, "recurrent_constraint": null, "unroll": false, "use_bias": true, "kernel_regularizer": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "GRU"}, {"config": {"name": "gru_2", "go_backwards": false, "implementation": 1, "bias_constraint": null, "return_state": false, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "trainable": true, "reset_after": false, "recurrent_constraint": null, "unroll": false, "use_bias": true, "kernel_regularizer": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "GRU"}, {"config": {"name": "gru_3", "go_backwards": false, "implementation": 1, "bias_constraint": null, "return_state": false, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "trainable": true, "reset_after": false, "recurrent_constraint": null, "unroll": false, "use_bias": true, "kernel_regularizer": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "GRU"}, {"config": {"name": "gru_4", "go_backwards": false, "implementation": 1, "bias_constraint": null, "return_state": false, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "trainable": true, "reset_after": false, "recurrent_constraint": null, "unroll": false, "use_bias": true, "kernel_regularizer": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "GRU"}, {"config": {"name": "gru_5", "go_backwards": false, "implementation": 1, "bias_constraint": null, "return_state": false, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "trainable": true, "reset_after": false, "recurrent_constraint": null, "unroll": false, "use_bias": true, "kernel_regularizer": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "GRU"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "units": 16, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "units": 4, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}