{"keras_version": "2.1.6", "config": [{"config": {"batch_input_shape": [null, 30, 1], "trainable": true, "name": "reshape_1", "dtype": "float32", "target_shape": [30, 1]}, "class_name": "Reshape"}, {"config": {"activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_1", "dilation_rate": [1], "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_size": [3], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "filters": 16, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_2", "dilation_rate": [1], "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1], "kernel_size": [3], "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "filters": 16, "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"strides": [2], "pool_size": [2], "trainable": true, "padding": "valid", "name": "max_pooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 48}, "class_name": "Dense"}, {"config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 24}, "class_name": "Dense"}, {"config": {"activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 4}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}