{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [30], "name": "reshape_1", "batch_input_shape": [null, 30, 1], "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "tanh", "name": "dense_1", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "tanh", "name": "dense_2", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "tanh", "name": "dense_3", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "tanh", "name": "dense_4", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "tanh", "name": "dense_5", "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activation": "linear", "name": "dense_6", "kernel_regularizer": null, "trainable": true}}], "keras_version": "2.1.6"}