{"config": [{"config": {"name": "reshape_1", "batch_input_shape": [null, 30, 1], "target_shape": [30], "trainable": true, "dtype": "float32"}, "class_name": "Reshape"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16}, "class_name": "Dense"}, {"config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 4}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}